Revit 2026 API

# WorksetVisibility Enumeration

---

Indicates the visibility settings of a workset in a particular view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WorksetVisibility
```
```vb
Public Enumeration WorksetVisibility
```
```cpp
public enum class WorksetVisibility
```
```fsharp
type WorksetVisibility
```

| Member name | Value | Description |
| --- | --- | --- |
| Hidden | 1 | Be hidden in a view. |
| UseGlobalSetting | 2 | Do not override the visibility. |
| Visible | 0 | Be visible in a view (i.e. will be visible unless it is closed). |

#### Reference

Autodesk.Revit.DB Namespace